In [2]:
import pandas as pd  
import numpy as np

* dataframe:Collection of series.
* To create DataFrame:List,dict,read_csv,etc.

In [3]:
# using List 
Lt=[['A','B','C','D'],[44,25,74,55]]
Lt
pd.DataFrame(Lt)
pd.DataFrame(Lt,columns=['sum','mon','tue','wed'])

  sum mon tue wed
0   A   B   C   D
1  44  25  74  55

In [4]:
#Using Dictionary
Dt={'Name':['amit','rohan','mohan','aman'],'Score':[23,42,54,55]}
Dt
pd.DataFrame(Dt)

    Name  Score
0   amit     23
1  rohan     42
2  mohan     54
3   aman     55

In [15]:
df=pd.read_csv("D:/Ad_py_lib.csv/ml_csv/house.csv")
df

,POSTED_BY,UNDER_CONSTRUCTION,RERA,BHK_NO.,BHK_OR_RK,SQUARE_FT,READY_TO_MOVE,RESALE,ADDRESS,LONGITUDE,LATITUDE,TARGET(PRICE_IN_LACS)
0,Owner,0,0,2,BHK,1300.236407,1,1,"Ksfc Layout,Bangalore",12.969910,77.597960,55.0
1,Dealer,0,0,2,BHK,1275.000000,1,1,"Vishweshwara Nagar,Mysore",12.274538,76.644605,51.0
2,Owner,0,0,2,BHK,933.159722,1,1,"Jigani,Bangalore",12.778033,77.632191,43.0
3,Owner,0,1,2,BHK,929.921143,1,1,"Sector-1 Vaishali,Ghaziabad",28.642300,77.344500,62.5
4,Dealer,1,0,2,BHK,999.009247,0,1,"New Town,Kolkata",22.592200,88.484911,60.5
...,...,...,...,...,...,...,...,...,...,...,...,...
29446,Owner,0,0,3,BHK,2500.000000,1,1,"Shamshabad Road,Agra",27.140626,78.043277,45.0
29447,Owner,0,0,2,BHK,769.230769,1,1,"E3-108, Lake View Recidency,,Vapi",39.945409,-86.150721,16.0
29448,Dealer,0,0,2,BHK,1022.641509,1,1,"Ajmer Road,Jaipur",26.928785,75.828002,27.1
29449,Owner,0,0,2,BHK,927.079009,1,1,"Sholinganallur,Chennai",12.900150,80.227910,67.0
29450,Dealer,0,1,2,BHK,896.774194,1,1,"Jagatpura,Jaipur",26.832353,75.841749,27.8

In [17]:
import sys
print(sys.getsizeof(df))

7309351

In [6]:
df.size

353412

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.dtypes

POSTED_BY                 object
UNDER_CONSTRUCTION         int64
RERA                       int64
BHK_NO.                    int64
BHK_OR_RK                 object
SQUARE_FT                float64
READY_TO_MOVE              int64
RESALE                     int64
ADDRESS                   object
LONGITUDE                float64
LATITUDE                 float64
TARGET(PRICE_IN_LACS)    float64
dtype: object

In [43]:
df.shape

(29451, 12)

In [44]:
df.columns

Index(['POSTED_BY', 'UNDER_CONSTRUCTION', 'RERA', 'BHK_NO.', 'BHK_OR_RK',
       'SQUARE_FT', 'READY_TO_MOVE', 'RESALE', 'ADDRESS', 'LONGITUDE',
       'LATITUDE', 'TARGET(PRICE_IN_LACS)'],
      dtype='object')

In [45]:
df['POSTED_BY']

0         Owner
1        Dealer
2         Owner
3         Owner
4        Dealer
          ...
29446     Owner
29447     Owner
29448    Dealer
29449     Owner
29450    Dealer
Name: POSTED_BY, Length: 29451, dtype: object

In [25]:
type(df['POSTED_BY'])

pandas.core.series.Series

In [27]:
type(df)

pandas.core.frame.DataFrame

In [9]:
print(df['POSTED_BY'].dtype)

object

In [10]:
print(df['RERA'].dtype)

int64

In [18]:
df['RERA'].astype('int32')
df['RERA']=df['RERA'].astype('int32')
print(df['RERA'].dtype)

int32

In [19]:
import sys
print(sys.getsizeof(df))

7191547

In [49]:
# import pandas as pd

# print(df.memory_usage())

Index                       132
POSTED_BY                235608
UNDER_CONSTRUCTION       235608
RERA                     235608
BHK_NO.                  235608
BHK_OR_RK                235608
SQUARE_FT                235608
READY_TO_MOVE            235608
RESALE                   235608
ADDRESS                  235608
LONGITUDE                235608
LATITUDE                 235608
TARGET(PRICE_IN_LACS)    235608
dtype: int64

In [1]:
# total = df.memory_usage(deep=True).sum()
# print("Total memory used:", total, "bytes")

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29451 entries, 0 to 29450
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   POSTED_BY              29451 non-null  object
 1   UNDER_CONSTRUCTION     29451 non-null  int64
 2   RERA                   29451 non-null  int32
 3   BHK_NO.                29451 non-null  int64
 4   BHK_OR_RK              29451 non-null  object
 5   SQUARE_FT              29451 non-null  float64
 6   READY_TO_MOVE          29451 non-null  int64
 7   RESALE                 29451 non-null  int64
 8   ADDRESS                29451 non-null  object
 9   LONGITUDE              29451 non-null  float64
 10  LATITUDE               29451 non-null  float64
 11  TARGET(PRICE_IN_LACS)  29451 non-null  float64
dtypes: float64(4), int32(1), int64(4), object(3)
memory usage: 2.6+ MB

In [21]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
UNDER_CONSTRUCTION,29451.0,0.179756,3.839908e-01,0.000000,0.000000,0.000000,0.000000,1.000000e+00
RERA,29451.0,0.317918,4.656753e-01,0.000000,0.000000,0.000000,1.000000,1.000000e+00
BHK_NO.,29451.0,2.392279,8.790913e-01,1.000000,2.000000,2.000000,3.000000,2.000000e+01
SQUARE_FT,29451.0,19802.170190,1.901335e+06,3.000000,900.021130,1175.056750,1550.688124,2.545455e+08
READY_TO_MOVE,29451.0,0.820244,3.839908e-01,0.000000,1.000000,1.000000,1.000000,1.000000e+00
RESALE,29451.0,0.929578,2.558613e-01,0.000000,1.000000,1.000000,1.000000,1.000000e+00
LONGITUDE,29451.0,21.300255,6.205306e+00,-37.713008,18.452663,20.750000,26.900926,5.991288e+01
LATITUDE,29451.0,76.837695,1.055775e+01,-121.761248,73.798100,77.324137,77.828740,1.529627e+02
TARGET(PRICE_IN_LACS),29451.0,142.898746,6.568807e+02,0.250000,38.000000,62.000000,100.000000,3.000000e+04

In [22]:
df.ndim

2

In [23]:
df.shape

(29451, 12)

In [56]:
# Return the required values
n=[10,3,53,44,64,35,74,6,3,53,16]
dt=pd.DataFrame(n,columns=['score'])

In [57]:
dt.duplicated().sum()

np.int64(2)

In [38]:
dt

    score
0      10
1       3
2      53
3      44
4      64
5      35
6      74
7       6
8       3
9      53
10     16

In [30]:
dt['score'].between(10,64)

0     True
1    False
2     True
3     True
4     True
5     True
6    False
7    False
8     True
Name: score, dtype: bool

In [31]:
dt[dt['score'].between(10,64)]

   score
0     10
2     53
3     44
4     64
5     35
8     16

In [39]:
dt[dt['score'].between(10,64)].count()

score    7
dtype: int64

In [40]:
dt[dt['score'].between(10,64)].sum()

score    275
dtype: int64

In [45]:
dt.drop_duplicates()#delele last duplicates value.

    score
0      10
1       3
2      53
3      44
4      64
5      35
6      74
7       6
10     16

In [58]:
dt.drop_duplicates(keep='last')#delele first duplicate value and keep last duplicate value.

    score
0      10
3      44
4      64
5      35
6      74
7       6
8       3
9      53
10     16

In [59]:
dt.duplicated().sum()

np.int64(2)